app/controllers/songs_controller.rb

  def upload

    CSV.foreach(params['file'].path, headers: true) do |lead|
      song = Song.create(title: lead[0])
      artist = Artist.create_or_find(name: lead[1])
---
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 137], ["created_at", "2018-11-16 18:52:12.627461"], ["updated_at", "2018-11-16 18:52:12.627461"]]
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-11-16 18:51:09.497862"], ["updated_at", "2018-11-16 18:51:09.497862"]]

  def edit
    @song = Song.find(params[:id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 12]]